app/controllers/api/v1/characters_controller.rb

    def index
        characters = Character.all
---
SELECT "user_characters".* FROM "user_characters" WHERE "user_characters"."character_id" = ?  [["character_id", 1]]

    def create
        character = current_user.characters.find_or_create_by(character_params)
---
INSERT INTO "user_characters" ("user_id", "character_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 4], ["character_id", 5], ["created_at", "2020-03-24 22:02:09.045978"], ["updated_at", "2020-03-24 22:02:09.045978"]]

    def show
        character = Character.find_by_id(params[:id])
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]