app/controllers/api/v1/user_characters_controller.rb

    def create
        user = User.first
        character = Character.find_or_create_by(character_params)
        user_character = user.user_characters.new(details_params)
        user_character.character_id = character.id
        user_character.save
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "user_characters".* FROM "user_characters" WHERE "user_characters"."character_id" = ?  [["character_id", 16]]
INSERT INTO "characters" ("name", "description", "thumbnail", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "user_characters" ("comments", "user_id", "character_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comments", "he is funny"], ["user_id", 1], ["character_id", 9], ["created_at", "2020-03-20 15:00:46.327222"], ["updated_at", "2020-03-20 15:00:46.327222"]]