app/controllers/api/v1/user_characters_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def create
        user = User.find_by(id: 2)