app/controllers/concerns/application_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
    def current_user
         User.last